stressTest/script.yml
  config:
    plugins:
      aws-sigv4:
        serviceName: "execute-api"
    target: "{{ $processEnvironment.TODO_API_ENDPOINT }}"
    phases:
        - duration: 10
          arrivalRate: 100
    defaults:
      headers:
        Content-type: 'application/json'
  scenarios:
    - name: "GET todos"
      beforeRequest: "addAmazonSignatureV4"
      flow:
      - post:
          url: "/todos"
          json:
            title: "That's really todo today"
            content: "Why not postponing to tomorrow ???"
      - get:
          url: "/todos"